Revit 2027 API
DirectShapeLibrary.GetDirectShapeLibrary Method
 Get the currently active Library object
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static DirectShapeLibrary GetDirectShapeLibrary(
	Document ADoc
)
Public Shared Function GetDirectShapeLibrary (
	ADoc As Document
) As DirectShapeLibrary
public:
static DirectShapeLibrary^ GetDirectShapeLibrary(
	Document^ ADoc
)
static member GetDirectShapeLibrary :
        ADoc : Document -> DirectShapeLibrary
Parameters
ADoc Document
Return Value
DirectShapeLibrary
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
Autodesk.Revit.DB Namespace